import React from 'react'
import img00 from '../assets/img/img00.jpg'

const Port = () => {
    return (
        <section id="port">
            <div className="port__inner">
                <div className="port__title">
                    portfolio <em>포트폴리오</em>
                </div>
                <div className="port__wrap">
                    <div className="port__item p1">
                        <span className="num">1</span>
                        <a href="/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                                <g>
                                    <path d="M13.85,11.65c0.2,0.18,0.19,0.52,0,0.7l-3,3c-0.19,0.2-0.5,0.19-0.7,0c-0.2-0.18-0.19-0.52,0-0.7
                    L12.79,12l-2.64-2.65c-0.2-0.19-0.19-0.5,0-0.7c0.18-0.2,0.52-0.19,0.7,0L13.85,11.65z" />
                                    <path d="M12,2.067c5.477,0,9.933,4.456,9.933,9.933S17.477,21.933,12,21.933S2.067,17.477,2.067,12
                    S6.523,2.067,12,2.067z M12,20.933c4.926,0,8.933-4.007,8.933-8.933S16.926,3.067,12,3.067S3.067,7.074,3.067,12
                    S7.074,20.933,12,20.933z" />
                                </g>
                            </svg>
                            <img src={img00} alt="포트폴리오" rel="noreferrer noopener" />
                        </a>
                        <h3 className="title">리액트를 이용한 포트폴리오</h3>
                        <p className="desc">
                            리액트를 이용한 포트폴리오 설명
                        </p>
                    </div>
                    <div className="port__item p2">
                        <span className="num">2</span>
                        <a href="/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                                <g>
                                    <path d="M13.85,11.65c0.2,0.18,0.19,0.52,0,0.7l-3,3c-0.19,0.2-0.5,0.19-0.7,0c-0.2-0.18-0.19-0.52,0-0.7
                    L12.79,12l-2.64-2.65c-0.2-0.19-0.19-0.5,0-0.7c0.18-0.2,0.52-0.19,0.7,0L13.85,11.65z" />
                                    <path d="M12,2.067c5.477,0,9.933,4.456,9.933,9.933S17.477,21.933,12,21.933S2.067,17.477,2.067,12
                    S6.523,2.067,12,2.067z M12,20.933c4.926,0,8.933-4.007,8.933-8.933S16.926,3.067,12,3.067S3.067,7.074,3.067,12
                    S7.074,20.933,12,20.933z" />
                                </g>
                            </svg>
                            <img src={img00} alt="포트폴리오" rel="noreferrer noopener" />
                        </a>
                        <h3 className="title">리액트를 이용한 포트폴리오</h3>
                        <p className="desc">
                            리액트를 이용한 포트폴리오 설명
                        </p>
                    </div>
                    <div className="port__item p3">
                        <span className="num">3</span>
                        <a href="/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                                <g>
                                    <path d="M13.85,11.65c0.2,0.18,0.19,0.52,0,0.7l-3,3c-0.19,0.2-0.5,0.19-0.7,0c-0.2-0.18-0.19-0.52,0-0.7
                    L12.79,12l-2.64-2.65c-0.2-0.19-0.19-0.5,0-0.7c0.18-0.2,0.52-0.19,0.7,0L13.85,11.65z" />
                                    <path d="M12,2.067c5.477,0,9.933,4.456,9.933,9.933S17.477,21.933,12,21.933S2.067,17.477,2.067,12
                    S6.523,2.067,12,2.067z M12,20.933c4.926,0,8.933-4.007,8.933-8.933S16.926,3.067,12,3.067S3.067,7.074,3.067,12
                    S7.074,20.933,12,20.933z" />
                                </g>
                            </svg>
                            <img src={img00} alt="포트폴리오" rel="noreferrer noopener" />
                        </a>
                        <h3 className="title">리액트를 이용한 포트폴리오</h3>
                        <p className="desc">
                            리액트를 이용한 포트폴리오 설명
                        </p>
                    </div>
                    <div className="port__item p4">
                        <span className="num">4</span>
                        <a href="/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                                <g>
                                    <path d="M13.85,11.65c0.2,0.18,0.19,0.52,0,0.7l-3,3c-0.19,0.2-0.5,0.19-0.7,0c-0.2-0.18-0.19-0.52,0-0.7
                    L12.79,12l-2.64-2.65c-0.2-0.19-0.19-0.5,0-0.7c0.18-0.2,0.52-0.19,0.7,0L13.85,11.65z" />
                                    <path d="M12,2.067c5.477,0,9.933,4.456,9.933,9.933S17.477,21.933,12,21.933S2.067,17.477,2.067,12
                    S6.523,2.067,12,2.067z M12,20.933c4.926,0,8.933-4.007,8.933-8.933S16.926,3.067,12,3.067S3.067,7.074,3.067,12
                    S7.074,20.933,12,20.933z" />
                                </g>
                            </svg>
                            <img src={img00} alt="포트폴리오" rel="noreferrer noopener" />
                        </a>
                        <h3 className="title">리액트를 이용한 포트폴리오</h3>
                        <p className="desc">
                            리액트를 이용한 포트폴리오 설명
                        </p>
                    </div>
                    <div className="port__item p5">
                        <span className="num">5</span>
                        <a href="/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                                <g>
                                    <path d="M13.85,11.65c0.2,0.18,0.19,0.52,0,0.7l-3,3c-0.19,0.2-0.5,0.19-0.7,0c-0.2-0.18-0.19-0.52,0-0.7
                    L12.79,12l-2.64-2.65c-0.2-0.19-0.19-0.5,0-0.7c0.18-0.2,0.52-0.19,0.7,0L13.85,11.65z" />
                                    <path d="M12,2.067c5.477,0,9.933,4.456,9.933,9.933S17.477,21.933,12,21.933S2.067,17.477,2.067,12
                    S6.523,2.067,12,2.067z M12,20.933c4.926,0,8.933-4.007,8.933-8.933S16.926,3.067,12,3.067S3.067,7.074,3.067,12
                    S7.074,20.933,12,20.933z" />
                                </g>
                            </svg>
                            <img src={img00} alt="포트폴리오" rel="noreferrer noopener" />
                        </a>
                        <h3 className="title">리액트를 이용한 포트폴리오</h3>
                        <p className="desc">
                            리액트를 이용한 포트폴리오 설명
                        </p>
                    </div>
                    <div className="port__item p6">
                        <span className="num">6</span>
                        <a href="/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                                <g>
                                    <path d="M13.85,11.65c0.2,0.18,0.19,0.52,0,0.7l-3,3c-0.19,0.2-0.5,0.19-0.7,0c-0.2-0.18-0.19-0.52,0-0.7
                    L12.79,12l-2.64-2.65c-0.2-0.19-0.19-0.5,0-0.7c0.18-0.2,0.52-0.19,0.7,0L13.85,11.65z" />
                                    <path d="M12,2.067c5.477,0,9.933,4.456,9.933,9.933S17.477,21.933,12,21.933S2.067,17.477,2.067,12
                    S6.523,2.067,12,2.067z M12,20.933c4.926,0,8.933-4.007,8.933-8.933S16.926,3.067,12,3.067S3.067,7.074,3.067,12
                    S7.074,20.933,12,20.933z" />
                                </g>
                            </svg>
                            <img src={img00} alt="포트폴리오" rel="noreferrer noopener" />
                        </a>
                        <h3 className="title">리액트를 이용한 포트폴리오</h3>
                        <p className="desc">
                            리액트를 이용한 포트폴리오 설명
                        </p>
                    </div>
                    <div className="port__item p7">
                        <span className="num">7</span>
                        <a href="/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                                <g>
                                    <path d="M13.85,11.65c0.2,0.18,0.19,0.52,0,0.7l-3,3c-0.19,0.2-0.5,0.19-0.7,0c-0.2-0.18-0.19-0.52,0-0.7
                    L12.79,12l-2.64-2.65c-0.2-0.19-0.19-0.5,0-0.7c0.18-0.2,0.52-0.19,0.7,0L13.85,11.65z" />
                                    <path d="M12,2.067c5.477,0,9.933,4.456,9.933,9.933S17.477,21.933,12,21.933S2.067,17.477,2.067,12
                    S6.523,2.067,12,2.067z M12,20.933c4.926,0,8.933-4.007,8.933-8.933S16.926,3.067,12,3.067S3.067,7.074,3.067,12
                    S7.074,20.933,12,20.933z" />
                                </g>
                            </svg>
                            <img src={img00} alt="포트폴리오" rel="noreferrer noopener" />
                        </a>
                        <h3 className="title">리액트를 이용한 포트폴리오</h3>
                        <p className="desc">
                            리액트를 이용한 포트폴리오 설명
                        </p>
                    </div>
                    <div className="port__item p8">
                        <span className="num">8</span>
                        <a href="/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                                <g>
                                    <path d="M13.85,11.65c0.2,0.18,0.19,0.52,0,0.7l-3,3c-0.19,0.2-0.5,0.19-0.7,0c-0.2-0.18-0.19-0.52,0-0.7
                    L12.79,12l-2.64-2.65c-0.2-0.19-0.19-0.5,0-0.7c0.18-0.2,0.52-0.19,0.7,0L13.85,11.65z" />
                                    <path d="M12,2.067c5.477,0,9.933,4.456,9.933,9.933S17.477,21.933,12,21.933S2.067,17.477,2.067,12
                    S6.523,2.067,12,2.067z M12,20.933c4.926,0,8.933-4.007,8.933-8.933S16.926,3.067,12,3.067S3.067,7.074,3.067,12
                    S7.074,20.933,12,20.933z" />
                                </g>
                            </svg>
                            <img src={img00} alt="포트폴리오" rel="noreferrer noopener" />
                        </a>
                        <h3 className="title">리액트를 이용한 포트폴리오</h3>
                        <p className="desc">
                            리액트를 이용한 포트폴리오 설명
                        </p>
                    </div>
                    <div className="port__item p9">
                        <span className="num">9</span>
                        <a href="/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                                <g>
                                    <path d="M13.85,11.65c0.2,0.18,0.19,0.52,0,0.7l-3,3c-0.19,0.2-0.5,0.19-0.7,0c-0.2-0.18-0.19-0.52,0-0.7
                    L12.79,12l-2.64-2.65c-0.2-0.19-0.19-0.5,0-0.7c0.18-0.2,0.52-0.19,0.7,0L13.85,11.65z" />
                                    <path d="M12,2.067c5.477,0,9.933,4.456,9.933,9.933S17.477,21.933,12,21.933S2.067,17.477,2.067,12
                    S6.523,2.067,12,2.067z M12,20.933c4.926,0,8.933-4.007,8.933-8.933S16.926,3.067,12,3.067S3.067,7.074,3.067,12
                    S7.074,20.933,12,20.933z" />
                                </g>
                            </svg>
                            <img src={img00} alt="포트폴리오" rel="noreferrer noopener" />
                        </a>
                        <h3 className="title">리액트를 이용한 포트폴리오</h3>
                        <p className="desc">
                            리액트를 이용한 포트폴리오 설명
                        </p>
                    </div>
                    <div className="port__item p10">
                        <span className="num">10</span>
                        <a href="/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                                <g>
                                    <path d="M13.85,11.65c0.2,0.18,0.19,0.52,0,0.7l-3,3c-0.19,0.2-0.5,0.19-0.7,0c-0.2-0.18-0.19-0.52,0-0.7
                    L12.79,12l-2.64-2.65c-0.2-0.19-0.19-0.5,0-0.7c0.18-0.2,0.52-0.19,0.7,0L13.85,11.65z" />
                                    <path d="M12,2.067c5.477,0,9.933,4.456,9.933,9.933S17.477,21.933,12,21.933S2.067,17.477,2.067,12
                    S6.523,2.067,12,2.067z M12,20.933c4.926,0,8.933-4.007,8.933-8.933S16.926,3.067,12,3.067S3.067,7.074,3.067,12
                    S7.074,20.933,12,20.933z" />
                                </g>
                            </svg>
                            <img src={img00} alt="포트폴리오" rel="noreferrer noopener" />
                        </a>
                        <h3 className="title">리액트를 이용한 포트폴리오</h3>
                        <p className="desc">
                            리액트를 이용한 포트폴리오 설명
                        </p>
                    </div>
                </div>
            </div>
        </section>
    )
}

export default Port